let x = 6, y = 14, z = 4;

console.log(x += y - x++ * z);   // 6 + 14 - 24, буде -4,    інкремент для Х не змінює його далі множиться на Z(4), потім це віднімається від У(14) і додається Х(6), результат записується в Х
console.log(z = -x - y * 5);     // --[+]4 - (14 * 5), буде - 66,    У(14) множиться на 5, потім це віднімається від Х(- - 4 = 4), результат записується в Z
console.log(y /= x + 5 % z);     // 14 / (-4 + (5 % 66[=5])), буде 14,   залишок від ділення (5 на -66), додається Х(-4), ділеться на У(14), результат записується в У
console.log(z - x + + + y * 5);  // -66 --[+]4 + (14 * 5), буде 8,   У(14) множемо на 5, додаємо це до різниці між Z(-66) та Х(- - 4 = 4), результат нікуди не записується
console.log(x = y - x++ * z);    // 14 - (--[+]4 * -66), буде -250,    інкремент для Х(-4) не змінює його, далі множиться на Z(-66), це віднімається від У(14), резульат записується в Х